app/views/users/show.html.erb

SELECT "events".* FROM "events" WHERE (datetime < ?)  [[nil, "2025-12-02 11:54:54.838017"]]
---
</h2>
<%= render partial: "events/event",
           collection: current_user.pending_events.where("datetime >= ?", Time.current),
           as: :event %>

SELECT "events".* FROM "events" WHERE (datetime < ?)  [[nil, "2025-12-02 11:54:54.838017"]]
---
</h2>
<%= render partial: "events/event",
           collection: current_user.declined_events.where("datetime >= ?", Time.current),
           as: :event %>