app/views/events/_event.html.erb

SELECT "event_invitations".* FROM "event_invitations" WHERE "event_invitations"."invited_user_id" = ?  [["invited_user_id", 2]]
SELECT "events".* FROM "events" INNER JOIN "event_invitations" ON "events"."id" = "event_invitations"."invited_event_id" WHERE "event_invitations"."invited_user_id" = ? AND (datetime >= ?)  [["invited_user_id", 2], [nil, "2026-01-13 10:52:23.039376"]]
---
<% invitation = event.event_invitations.find_by(invited_user: current_user) %>