app/views/events/index.html.erb

<ul>
  <% Event.future.each do |event| %>
---
SELECT "events".* FROM "events" WHERE (datetime >= ?)  [[nil, "2025-12-02 12:20:10.554290"]]

<ul>
  <% Event.past.each do |event| %>
---
SELECT "events".* FROM "events" WHERE (datetime < ?)  [[nil, "2025-12-02 12:20:10.559423"]]