app/views/events/new.html.erb

  <%= form.label :invited_users, "Who's invited?" %> <br>
  <%= form.collection_check_boxes :invited_user_ids, User.where.not(id: current_user.id).order(:username), :id, :username do |user| %>
---
SELECT "users".* FROM "users" ORDER BY "users"."username" ASC