app/controllers/events_controller.rb

SELECT "events".* FROM "events" WHERE (datetime >= ?)  [[nil, "2025-12-02 12:20:10.554290"]]
---
  def index
    @events = Event.all

INSERT INTO "events" ("title", "description", "datetime", "location", "created_at", "updated_at", "creator_id") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"
INSERT INTO "event_invitations" ("invited_user_id", "invited_event_id", "created_at", "updated_at", "status") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["invited_user_id", 5], ["invited_event_id", 8], ["created_at", "2026-01-27 09:42:15.152848"], ["updated_at", "2026-01-27 09:42:15.152848"], ["status", 1]]
---
  def create
    @event = current_user.created_events.build(event_params)

    if @event.save
      @event.event_invitations.create!(invited_user: current_user, status: :accepted)