app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "events".* FROM "events" WHERE "events"."id" IN (?, ?)  [["id", 1], ["id", 4]]
---
  def show
    @user = User.find(params[:id])
    @created_events = @user.created_events
    @event_invitations = @user.invited_events
    @pending_events = current_user.pending_events
                              .where("datetime >= ?", Time.current)
                              .includes(:event_invitations)